# RebarShapeEndtreatmentEndType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarShapeEndtreatmentEndType Property
ParameterTypeId Class See Also
---
"End Treatment At End"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarShapeEndtreatmentEndType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarShapeEndtreatmentEndType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarShapeEndtreatmentEndType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace